// Задача 30: Напишите программу, которая
// выводит массив из 8 элементов, заполненный
// нулями и единицами в случайном порядке.
// [1,0,1,1,0,1,0,0]

// int FillArray(int[] len)
// {
//     int[] arr =new int[len];
//     Random rnd= new Random();
//     for (int i = 0; i < len; i++)
//     {
//         arr[i] = rnd.Next(0,2);
//     }
//     return arr;
// }

// void PrintArray(int[] arr)
// {
//     Console.Write("[");
//     for (int i = 0; i < arr.Length; i++)
//     {
//     if (i<arr.Length-1) Console.Write(", ");

//     }
//     Console.Write("]");
// }
// Console.Write("Введите количесво элеметов массива ");
// int length= Convert.ToInt32(Console.ReadLine());
// int[] array = CreatArray(length);
// FillArray(array);
// PrintArray(array);





